Cttangg/stm32project/2.8-inch_LCD_Driver/Core/Lib/lcd.c
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,0); 
	}
} 
//显示数字,高位为0,还是显示
//x,y:起点坐标
//num:数值(0~999999999);	 
//len:长度(即要显示的位数)
//size:字体大小
//mode:
//[7]:0,不填充;1,填充0.
//[6:1]:保留
//[0]:0,非叠加显示;1,叠加显示.
void LCD_ShowxNum(u16 x,u16 y,u32 num,u8 len,u8 size,u8 mode)
{  
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				if(mode&0X80)LCD_ShowChar(x+(size/2)*t,y,'0',size,mode&0X01);  
				else LCD_ShowChar(x+(size/2)*t,y,' ',size,mode&0X01);  
 				continue;
			}else enshow=1; 
		 	 
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,mode&0X01); 
	}
} 
//显示字符串
//x,y:起点坐标
//width,height:区域大小  
//size:字体大小
//*p:字符串起始地址		  
void LCD_ShowString(u16 x,u16 y,u16 width,u16 height,u8 size,const char *p)
{         
	u8 x0=x;
	width+=x;
	height+=y;
    while((*p<='~')&&(*p>=' '))//判断是不是非法字符!
    {       
        if(x>=width){x=x0;y+=size;}
        if(y>=height)break;//退出
        LCD_ShowChar(x,y,*p,size,0);
        x+=size/2;
        p++;
    }  
}

/* 显示图片 (RGB565, img 存于 Flash)
 * 逐行设置光标再写, 不依赖 0x50~0x53 窗口回绕
 * (ILI9325 等克隆屏窗口回绕可能差 1 列, 导致逐行右移形成斜切) */
void LCD_ShowImage(u16 x,u16 y,u16 w,u16 h,const u16 *img)
{
	u16 row,col;
	for(row=0;row<h;row++)
	{
		if(lcddev.id==0X9341||lcddev.id==0X5310)
		{
			LCD_WR_REG(lcddev.setxcmd);
			LCD_WR_DATA(x>>8);LCD_WR_DATA(x&0XFF);
			LCD_WR_REG(lcddev.setycmd);
			LCD_WR_DATA((y+row)>>8);LCD_WR_DATA((y+row)&0XFF);
		}else
		{
			LCD_WriteReg(lcddev.setxcmd,x);
			LCD_WriteReg(lcddev.setycmd,y+row);
		}
		LCD_WriteRAM_Prepare();
		for(col=0;col<w;col++)LCD->LCD_RAM=img[(u32)row*w+col];
	}
}

